基本概念：
1、最大匹配
在G的一个子图M中，M的边集中的任意两条边都不依附于同一个顶点，则称M是一个匹配。
选择这样的边数最大的子集称为图的最大匹配问题,最大匹配的边数称为最大匹配数。
如果一个匹配中，图中的每个顶点都和图中某条边相关联，则称此匹配为完全匹配，也称作完备匹配。
如果在左右两边加上源汇点后，图G等价于一个网络流，二分图最大匹配问题可以转为最大流的问题。
解决此问的匈牙利算法的本质就是寻找最大流的增广路径。
2、最优匹配
最优匹配又称为带权最大匹配，是指在带有权值边的二分图中，求一个匹配使得匹配边上的权值和最大。
一般X和Y集合顶点个数相同，最优匹配也是一个完备匹配，即每个顶点都被匹配。
如果个数不相等，可以通过补点加0边实现转化。一般使用KM算法解决该问题。
3、最小覆盖
最小点覆盖是指最少的顶点数使得二分图G中的每条边都至少与其中一个点相关联。
最小路径覆盖也称为最小边覆盖，是指用尽量少的不相交简单路径覆盖二分图中的所有顶点。
4、最大独立集
最大独立集是指寻找一个点集，使得其中任意两点在图中无对应边。对于一般图来说，最大独立集是一个NP完全问题。

二分图是图论一个非常有趣的分支、可以很好地提高抽象模型与建图能力、同时算法思想也比较吸引人、

判断二分图：交叉染色法（奇偶染色）、如果图中存在奇环即表示非二分图、

最小点覆盖 = 最大匹配

最大点独立集 = 顶点数 - 最大匹配

有向图最小路径覆盖 = 原图顶点数 - 拆点后最大匹配

最小边覆盖 = 最大点独立集

5.二分图最大团
就是选出一些顶点，这些顶点两两之间都有边。最大团就是使得选出的这个顶点集合最大。
二分图的最大团=补图的最大独立集
补图：对于二分图中左边一点x和右边一点y，若x和y之间有边，那么在补图中没有，否则有。
